app/controllers/tournaments_controller.rb

  def index
    @tournaments = Tournament.all
---
SELECT "tournaments".* FROM "tournaments"

  def show
    tournament = Tournament.find_by(id: params.fetch(:id))
    divisions = tournament.groups.where(type: 'Group::Division')
---
SELECT  "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "groups".* FROM "groups" WHERE "groups"."tournament_id" = ? AND "groups"."type" = ?  [["tournament_id", 1], ["type", "Group::Division"]]